Repository: Git-Rocky-Stack/Agent-X
Catalog: src/AgentX.App/Strings/*/Resources.resw
Source language: en_us
Languages: de, es, fr, ja, zh_cn

# Settings_WatchFoldersDescription.Text
source: While the switch is on, Agent-X imports the supported files in these folders and keeps importing new and changed ones while it runs. Adding or removing a folder takes effect at once; the switch takes effect when you save settings.
de: Solange der Schalter eingeschaltet ist, importiert Agent-X die unterstützten Dateien in diesen Ordnern und importiert, während es läuft, laufend neue und geänderte. Das Hinzufügen oder Entfernen eines Ordners wirkt sofort; der Schalter wirkt, wenn Sie die Einstellungen speichern.
es: Mientras el interruptor está activado, Agent-X importa los archivos compatibles de estas carpetas y sigue importando los nuevos y los modificados mientras se ejecuta. Agregar o quitar una carpeta surte efecto al instante; el interruptor surte efecto al guardar la configuración.
fr: Tant que le commutateur est activé, Agent-X importe les fichiers pris en charge de ces dossiers, puis les fichiers nouveaux et modifiés tant qu’il est en cours d’exécution. L’ajout ou la suppression d’un dossier s’applique immédiatement ; le commutateur s’applique lorsque vous enregistrez les paramètres.
ja: スイッチがオンの間、Agent-X はこれらのフォルダー内のサポートされているファイルをインポートし、実行中は新しいファイルや変更されたファイルを引き続きインポートします。フォルダーの追加と削除はすぐに反映され、スイッチは設定を保存したときに反映されます。
zh_cn: 开关打开时，Agent-X 会导入这些文件夹中受支持的文件，并在运行期间持续导入新增和更改的文件。添加或删除文件夹会立即生效；开关在保存设置后生效。

# Settings_RemoveWatchFolder.ToolTipService.ToolTip
source: Remove watch folder
de: Überwachten Ordner entfernen
es: Quitar carpeta vigilada
fr: Supprimer le dossier surveillé
ja: 監視フォルダーを削除
zh_cn: 移除监视文件夹

source: Remove watch folder
de: Überwachten Ordner entfernen
es: Quitar carpeta vigilada
fr: Supprimer le dossier surveillé
ja: 監視フォルダーを削除
zh_cn: 移除监视文件夹

# Settings_NoWatchFolders.Text
source: No watch folders yet.
de: Noch keine überwachten Ordner.
es: Aún no hay carpetas vigiladas.
fr: Aucun dossier surveillé pour l’instant.
ja: 監視フォルダーはまだありません。
zh_cn: 尚无监视文件夹。

# Settings_AddWatchFolder.Content
source: Add Folder
de: Ordner hinzufügen
es: Agregar carpeta
fr: Ajouter un dossier
ja: フォルダーを追加
zh_cn: 添加文件夹

# Settings_WatchIncludeSubfolders.Content
source: Include subfolders
de: Unterordner einbeziehen
es: Incluir subcarpetas
fr: Inclure les sous-dossiers
ja: サブフォルダーを含める
zh_cn: 包括子文件夹

# Settings_WatchFoldersLoadFailed
source: Watch folders could not be loaded: {0}
de: Die überwachten Ordner konnten nicht geladen werden: {0}
es: No se pudieron cargar las carpetas vigiladas: {0}
fr: Impossible de charger les dossiers surveillés : {0}
ja: 監視フォルダーを読み込めませんでした: {0}
zh_cn: 无法加载监视文件夹：{0}

# Settings_WatchFolderNotFound
source: {0} was not found.
de: {0} wurde nicht gefunden.
es: No se encontró {0}.
fr: {0} est introuvable.
ja: {0} が見つかりませんでした。
zh_cn: 未找到 {0}。

# Settings_WatchFolderAlreadyAdded
source: {0} is already a watch folder.
de: {0} ist bereits ein überwachter Ordner.
es: {0} ya es una carpeta vigilada.
fr: {0} est déjà un dossier surveillé.
ja: {0} は既に監視フォルダーです。
zh_cn: {0} 已是监视文件夹。

# Settings_WatchFolderAddFailed
source: The folder could not be added: {0}
de: Der Ordner konnte nicht hinzugefügt werden: {0}
es: No se pudo agregar la carpeta: {0}
fr: Impossible d’ajouter le dossier : {0}
ja: フォルダーを追加できませんでした: {0}
zh_cn: 无法添加该文件夹：{0}

# Settings_WatchFolderAdded
source: Watching {0}. The supported files already in it are being imported.
de: {0} wird überwacht. Die darin bereits vorhandenen unterstützten Dateien werden importiert.
es: Se está vigilando {0}. Se están importando los archivos compatibles que ya contiene.
fr: {0} est surveillé. Les fichiers pris en charge qu’il contient déjà sont en cours d’importation.
ja: {0} を監視しています。フォルダー内の既存のサポートされているファイルをインポートしています。
zh_cn: 正在监视 {0}。正在导入其中已有的受支持文件。

# Settings_WatchFolderAddedPaused
source: Added {0}. Nothing is imported while Auto-index watch folders is off; turn it on and save settings to start.
de: {0} wurde hinzugefügt. Solange „Überwachte Ordner automatisch indexieren“ ausgeschaltet ist, wird nichts importiert; schalten Sie die Option ein und speichern Sie die Einstellungen, um zu beginnen.
es: Se agregó {0}. No se importa nada mientras Indexar automáticamente carpetas vigiladas esté desactivado; actívelo y guarde la configuración para empezar.
fr: {0} a été ajouté. Rien n’est importé tant que Indexer automatiquement les dossiers surveillés est désactivé ; activez-le et enregistrez les paramètres pour commencer.
ja: {0} を追加しました。「監視フォルダーを自動インデックス」がオフの間は何もインポートされません。開始するには、オンにして設定を保存してください。
zh_cn: 已添加 {0}。“自动索引监视文件夹”关闭时不会导入任何内容；请将其打开并保存设置以开始。

# Settings_WatchFolderRemoved
source: Stopped watching {0}. Documents already imported from it stay in the vault.
de: {0} wird nicht mehr überwacht. Bereits daraus importierte Dokumente bleiben im Tresor.
es: Se dejó de vigilar {0}. Los documentos ya importados desde ella permanecen en la bóveda.
fr: {0} n’est plus surveillé. Les documents déjà importés depuis ce dossier restent dans le coffre-fort.
ja: {0} の監視を停止しました。既にインポートされたドキュメントは Knowledge Vault に残ります。
zh_cn: 已停止监视 {0}。已从中导入的文档会保留在 Knowledge Vault 中。

# Settings_WatchFolderRemoveFailed
source: The folder could not be removed: {0}
de: Der Ordner konnte nicht entfernt werden: {0}
es: No se pudo quitar la carpeta: {0}
fr: Impossible de supprimer le dossier : {0}
ja: フォルダーを削除できませんでした: {0}
zh_cn: 无法移除该文件夹：{0}

# Settings_WatchFolderWithSubfolders
source: Includes subfolders. Files imported: {0}
de: Mit Unterordnern. Importierte Dateien: {0}
es: Incluye subcarpetas. Archivos importados: {0}
fr: Sous-dossiers inclus. Fichiers importés : {0}
ja: サブフォルダーを含む。インポートしたファイル: {0}
zh_cn: 包括子文件夹。已导入文件：{0}

# Settings_WatchFolderTopLevelOnly
source: This folder only. Files imported: {0}
de: Nur dieser Ordner. Importierte Dateien: {0}
es: Solo esta carpeta. Archivos importados: {0}
fr: Ce dossier uniquement. Fichiers importés : {0}
ja: このフォルダーのみ。インポートしたファイル: {0}
zh_cn: 仅此文件夹。已导入文件：{0}

# Settings_Language.Text
source: Language
de: Sprache
es: Idioma
fr: Langue
ja: 言語
zh_cn: 语言

source: Display language
de: Anzeigesprache
es: Idioma de la interfaz
fr: Langue d'affichage
ja: 表示言語
zh_cn: 显示语言

# Settings_LanguageWindowsDefault
source: Windows default
de: Windows-Standard
es: Predeterminado de Windows
fr: Valeur par défaut de Windows
ja: Windows の既定値
zh_cn: Windows 默认

# Settings_LanguageRestartHint.Text
source: Saved immediately. Restart Agent-X to see every page in the new language. 'Windows default' follows your Windows display language.
de: Wird sofort gespeichert. Starten Sie Agent-X neu, um alle Seiten in der neuen Sprache zu sehen. „Windows-Standard“ folgt der Anzeigesprache von Windows.
es: Se guarda de inmediato. Reinicie Agent-X para ver todas las páginas en el nuevo idioma. 'Predeterminado de Windows' sigue el idioma de visualización de Windows.
fr: Enregistré immédiatement. Redémarrez Agent-X pour afficher toutes les pages dans la nouvelle langue. « Valeur par défaut de Windows » suit la langue d'affichage de Windows.
ja: すぐに保存されます。すべてのページを新しい言語で表示するには、Agent-X を再起動してください。「Windows の既定値」は Windows の表示言語に従います。
zh_cn: 立即保存。重新启动 Agent-X 后，所有页面都会以新语言显示。“Windows 默认”跟随 Windows 显示语言。

# ExportDlg_FormatHtml
source: HTML web page (.html)
de: HTML-Webseite (.html)
es: Página web HTML (.html)
fr: Page web HTML (.html)
ja: HTML Web ページ (.html)
zh_cn: HTML 网页 (.html)

# ExportDlg_FormatPdf
source: PDF document (.pdf)
de: PDF-Dokument (.pdf)
es: Documento PDF (.pdf)
fr: Document PDF (.pdf)
ja: PDF ドキュメント (.pdf)
zh_cn: PDF 文档 (.pdf)

# ExportDlg_FormatJson
source: JSON data (.json)
de: JSON-Daten (.json)
es: Datos JSON (.json)
fr: Données JSON (.json)
ja: JSON データ (.json)
zh_cn: JSON 数据 (.json)

# ExportDlg_FormatPlainText
source: Plain text (.txt)
de: Nur-Text (.txt)
es: Texto sin formato (.txt)
fr: Texte brut (.txt)
ja: プレーン テキスト (.txt)
zh_cn: 纯文本 (.txt)

# ExportDlg_FormatCsv
source: CSV spreadsheet (.csv)
de: CSV-Tabelle (.csv)
es: Hoja de cálculo CSV (.csv)
fr: Feuille de calcul CSV (.csv)
ja: CSV スプレッドシート (.csv)
zh_cn: CSV 电子表格 (.csv)

# ExportDlg_FormatDocx
source: Word document (.docx)
de: Word-Dokument (.docx)
es: Documento de Word (.docx)
fr: Document Word (.docx)
ja: Word 文書 (.docx)
zh_cn: Word 文档 (.docx)

# ExportDlg_FormatPptx
source: PowerPoint presentation (.pptx)
de: PowerPoint-Präsentation (.pptx)
es: Presentación de PowerPoint (.pptx)
fr: Présentation PowerPoint (.pptx)
ja: PowerPoint プレゼンテーション (.pptx)
zh_cn: PowerPoint 演示文稿 (.pptx)

# ExportDlg_TemplateNone
source: (None)
de: (Keine)
es: (Ninguna)
fr: (Aucun)
ja: (なし)
zh_cn: (无)

# ExportDlg_TemplateResearchReport
source: Research report
de: Forschungsbericht
es: Informe de investigación
fr: Rapport de recherche
ja: 研究レポート
zh_cn: 研究报告

# ExportDlg_TemplateExecutiveSummary
source: Executive summary
de: Management-Zusammenfassung
es: Resumen ejecutivo
fr: Note de synthèse
ja: エグゼクティブ サマリー
zh_cn: 执行摘要

# ExportDlg_TemplateAnnotatedBibliography
source: Annotated bibliography
de: Kommentierte Bibliografie
es: Bibliografía comentada
fr: Bibliographie commentée
ja: 注釈付き参考文献
zh_cn: 注释书目

# ExportDlg_TitleFormat
source: Export: {0}
de: Exportieren: {0}
es: Exportar: {0}
fr: Exporter : {0}
ja: エクスポート: {0}
zh_cn: 导出：{0}

# Startup_PassphrasePlaceholder
source: Enter your database passphrase
de: Passphrase der Datenbank eingeben
es: Introduzca la frase de contraseña de la base de datos
fr: Saisissez la phrase secrète de la base de données
ja: データベースのパスフレーズを入力
zh_cn: 输入数据库密码短语

# Startup_UnlockTitle
source: Unlock your Agent-X database
de: Agent-X-Datenbank entsperren
es: Desbloquear la base de datos de Agent-X
fr: Déverrouiller la base de données Agent-X
ja: Agent-X データベースのロックを解除
zh_cn: 解锁 Agent-X 数据库

# Startup_UnlockButton
source: Unlock
de: Entsperren
es: Desbloquear
fr: Déverrouiller
ja: ロック解除
zh_cn: 解锁

# Startup_ExitAppButton
source: Exit app
de: App beenden
es: Salir de la aplicación
fr: Quitter l'application
ja: アプリを終了
zh_cn: 退出应用

# Startup_WrongPassphraseTitle
source: Incorrect passphrase
de: Falsche Passphrase
es: Frase de contraseña incorrecta
fr: Phrase secrète incorrecte
ja: パスフレーズが正しくありません
zh_cn: 密码短语不正确

# Startup_WrongPassphraseMessage
source: That passphrase did not unlock the database. Please try again. Agent-X cannot open this database, or restore a backup of it, without the correct passphrase.
de: Mit dieser Passphrase ließ sich die Datenbank nicht entsperren. Bitte versuchen Sie es erneut. Ohne die richtige Passphrase kann Agent-X diese Datenbank weder öffnen noch eine Sicherung davon wiederherstellen.
es: Esa frase de contraseña no desbloqueó la base de datos. Inténtelo de nuevo. Sin la frase de contraseña correcta, Agent-X no puede abrir esta base de datos ni restaurar una copia de seguridad de ella.
fr: Cette phrase secrète n'a pas déverrouillé la base de données. Veuillez réessayer. Sans la bonne phrase secrète, Agent-X ne peut ni ouvrir cette base de données ni en restaurer une sauvegarde.
ja: このパスフレーズではデータベースのロックを解除できませんでした。もう一度お試しください。正しいパスフレーズがないと、Agent-X はこのデータベースを開くことも、そのバックアップを復元することもできません。
zh_cn: 该密码短语未能解锁数据库。请重试。没有正确的密码短语，Agent-X 无法打开此数据库，也无法还原其备份。

# Startup_OkButton
source: OK
es: Aceptar
zh_cn: 确定

# Startup_FailedTitle
source: Agent-X could not start
de: Agent-X konnte nicht gestartet werden
es: Agent-X no pudo iniciarse
fr: Agent-X n'a pas pu démarrer
ja: Agent-X を起動できませんでした
zh_cn: Agent-X 无法启动

# Startup_SchemaIncomplete
source: The database schema is incomplete and could not be repaired automatically. Missing tables: {0}.
de: Das Datenbankschema ist unvollständig und konnte nicht automatisch repariert werden. Fehlende Tabellen: {0}.
es: El esquema de la base de datos está incompleto y no se pudo reparar automáticamente. Tablas que faltan: {0}.
fr: Le schéma de la base de données est incomplet et n'a pas pu être réparé automatiquement. Tables manquantes : {0}.
ja: データベース スキーマが不完全で、自動的に修復できませんでした。不足しているテーブル: {0}。
zh_cn: 数据库架构不完整，且无法自动修复。缺少的表：{0}。

# Startup_UpgradeFailed
source: The database could not be upgraded to the latest version.
de: Die Datenbank konnte nicht auf die neueste Version aktualisiert werden.
es: No se pudo actualizar la base de datos a la versión más reciente.
fr: La base de données n'a pas pu être mise à niveau vers la dernière version.
ja: データベースを最新バージョンにアップグレードできませんでした。
zh_cn: 无法将数据库升级到最新版本。

# Startup_FailedHelp
source: To protect your data, Agent-X stopped before loading any features. Backups can only be restored from inside Agent-X, so a backup cannot be restored from here. First copy the folder %LocalAppData%\AgentX somewhere safe, and include the log files from %LocalAppData%\AgentX\Logs when you report this problem.
de: Zum Schutz Ihrer Daten hat Agent-X angehalten, bevor Funktionen geladen wurden. Sicherungen lassen sich nur innerhalb von Agent-X wiederherstellen, daher ist das hier nicht möglich. Kopieren Sie zuerst den Ordner %LocalAppData%\AgentX an einen sicheren Ort, und fügen Sie die Protokolldateien aus %LocalAppData%\AgentX\Logs bei, wenn Sie dieses Problem melden.
es: Para proteger sus datos, Agent-X se detuvo antes de cargar cualquier función. Las copias de seguridad solo se pueden restaurar desde Agent-X, así que no es posible restaurar una desde aquí. Primero copie la carpeta %LocalAppData%\AgentX a un lugar seguro e incluya los archivos de registro de %LocalAppData%\AgentX\Logs cuando informe de este problema.
fr: Pour protéger vos données, Agent-X s'est arrêté avant de charger la moindre fonctionnalité. Les sauvegardes ne peuvent être restaurées que depuis Agent-X ; il est donc impossible d'en restaurer une ici. Copiez d'abord le dossier %LocalAppData%\AgentX en lieu sûr, et joignez les fichiers journaux de %LocalAppData%\AgentX\Logs lorsque vous signalez ce problème.
ja: データを保護するため、Agent-X は機能を読み込む前に停止しました。バックアップは Agent-X の中からしか復元できないため、ここでは復元できません。まず %LocalAppData%\AgentX フォルダーを安全な場所にコピーし、この問題を報告する際は %LocalAppData%\AgentX\Logs のログ ファイルを添付してください。
zh_cn: 为保护您的数据，Agent-X 在加载任何功能之前已停止。备份只能在 Agent-X 内部还原，因此无法在此处还原。请先将 %LocalAppData%\AgentX 文件夹复制到安全的位置，并在报告此问题时附上 %LocalAppData%\AgentX\Logs 中的日志文件。

# Startup_FailedManualRestore
source: To go back to a backup by hand: with Agent-X closed, delete agentx.db-wal and agentx.db-shm from %LocalAppData%\AgentX if they exist, then replace agentx.db with the database\agentx.db file from a .agentxbak backup made without a password (the file is a ZIP archive). Backups made with a password can only be opened by Agent-X.
de: So kehren Sie manuell zu einer Sicherung zurück: Löschen Sie bei geschlossenem Agent-X die Dateien agentx.db-wal und agentx.db-shm in %LocalAppData%\AgentX, falls vorhanden, und ersetzen Sie agentx.db durch die Datei database\agentx.db aus einer ohne Passwort erstellten .agentxbak-Sicherung (die Datei ist ein ZIP-Archiv). Mit Passwort erstellte Sicherungen kann nur Agent-X öffnen.
es: Para volver a una copia de seguridad manualmente: con Agent-X cerrado, elimine agentx.db-wal y agentx.db-shm de %LocalAppData%\AgentX si existen y, a continuación, sustituya agentx.db por el archivo database\agentx.db de una copia de seguridad .agentxbak creada sin contraseña (el archivo es un archivo ZIP). Las copias de seguridad creadas con contraseña solo las puede abrir Agent-X.
fr: Pour revenir manuellement à une sauvegarde : Agent-X étant fermé, supprimez agentx.db-wal et agentx.db-shm de %LocalAppData%\AgentX s'ils existent, puis remplacez agentx.db par le fichier database\agentx.db d'une sauvegarde .agentxbak créée sans mot de passe (le fichier est une archive ZIP). Seul Agent-X peut ouvrir les sauvegardes créées avec un mot de passe.
ja: 手動でバックアップに戻すには: Agent-X を閉じた状態で、%LocalAppData%\AgentX に agentx.db-wal と agentx.db-shm があれば削除し、agentx.db を、パスワードなしで作成した .agentxbak バックアップ内の database\agentx.db ファイルに置き換えます (このファイルは ZIP アーカイブです)。パスワード付きで作成したバックアップは Agent-X でしか開けません。
zh_cn: 手动恢复到备份：在 Agent-X 关闭的情况下，如果 %LocalAppData%\AgentX 中存在 agentx.db-wal 和 agentx.db-shm，请将其删除，然后用不带密码创建的 .agentxbak 备份中的 database\agentx.db 文件替换 agentx.db（该文件是 ZIP 压缩包）。带密码创建的备份只能由 Agent-X 打开。

# Startup_ExitButton
source: Exit
de: Beenden
es: Salir
fr: Quitter
ja: 終了
zh_cn: 退出

# UserGuide_KnowledgeVault_Title.Text
source: Knowledge Vault
de: Wissens-Tresor
es: Bóveda de Conocimiento
fr: Coffre-fort de Connaissances

# UserGuide_Settings_Group3_Title.Text
source: Knowledge Vault
de: Wissens-Tresor
es: Bóveda de Conocimiento
fr: Coffre-fort de Connaissances

# Ops_PlaceholderVault
source: Vault
de: Tresor
es: Bóveda

# Shortcut_KnowledgeVault
source: Knowledge Vault
de: Wissens-Tresor
es: Bóveda de Conocimiento

# Main_KnowledgeVault.Content
source: Knowledge Vault
de: Wissens-Tresor
es: Bóveda de Conocimiento
fr: Coffre-fort de Connaissances

# Dash_AcrossRun.Text
source: across
de: in
es: en
fr: dans

# WebImport_Of.Text
source: of
de: von
es: de
fr: sur

# Settings_KnowledgeVault.Text
source: Knowledge Vault
de: Wissens-Tresor
es: Bóveda de Conocimiento
fr: Coffre-fort de Connaissances

# Vault_PageTitle.Text
source: KNOWLEDGE VAULT
de: WISSENS-TRESOR
es: BÓVEDA DE CONOCIMIENTO
fr: COFFRE-FORT DE CONNAISSANCES

# Plugin_Install.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Install plugin from file
de: Plugin installieren
es: Instalar plugin desde archivo
fr: Installer un plugin depuis un fichier

# Plugin_Refresh.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Refresh plugins
de: Plugins aktualisieren
es: Actualizar plugins
fr: Actualiser les plugins

# Plugin_Uninstall.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Uninstall this plugin
de: Plugin deinstallieren
es: Desinstalar este plugin
fr: D&#233;sinstaller ce plugin

# Onb_NoModelsDesc.Text
source: Ollama is not connected, so models cannot be listed. You can configure models later in Settings or the Model Manager.
fr: Ollama n'est pas connecté, les modèles ne peuvent donc pas être listés. Vous pourrez les configurer plus tard dans les Paramètres ou le Gestionnaire de modèles.

# Settings_NoTokenYetClickPh.PlaceholderText
source: No token yet — click Regenerate
fr: Pas encore de jeton — cliquez sur Régénérer
